driver-tests/bpelse/assign/VariableAssignments/src/VariableAssignments.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="VariableAssignments" targetNamespace="http://j2ee.netbeans.org/wsdl/VariableAssignments"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/VariableAssignments" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <types/>
    <message name="VariableAssignmentsOperationRequest">
        <part name="part1" type="xsd:string"/>
    </message>
    <message name="VariableAssignmentsOperationReply">
        <part name="part1" type="xsd:string"/>
    </message>
    <portType name="VariableAssignmentsPortType">
        <wsdl:operation name="VariableAssignmentsOperation">
            <wsdl:input name="input1" message="tns:VariableAssignmentsOperationRequest"/>
            <wsdl:output name="output1" message="tns:VariableAssignmentsOperationReply"/>
        </wsdl:operation>
    </portType>
    <binding name="VariableAssignmentsBinding" type="tns:VariableAssignmentsPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="VariableAssignmentsOperation">
            <soap:operation/>
            <wsdl:input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/VariableAssignments"/>
            </wsdl:input>
            <wsdl:output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/VariableAssignments"/>
            </wsdl:output>
        </wsdl:operation>
    </binding>
    <service name="VariableAssignmentsService">
        <wsdl:port name="VariableAssignmentsPort" binding="tns:VariableAssignmentsBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/VariableAssignmentsService/VariableAssignmentsPort"/>
        </wsdl:port>
    </service>
    <plnk:partnerLinkType name="VariableAssignments1">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="VariableAssignmentsPortTypeRole" portType="tns:VariableAssignmentsPortType"/>
    </plnk:partnerLinkType>
</definitions>
