driver-tests/bpelse/assign/VariableAssignmentsJBI/test/RPCStyleTest/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:var="http://j2ee.netbeans.org/wsdl/VariableAssignments">
  <soapenv:Body>
    <var:VariableAssignmentsOperation>
      <part1>?string?</part1>
    </var:VariableAssignmentsOperation>
  </soapenv:Body>
</soapenv:Envelope>